Modules in roles
=====================
Created by kuleshovag on 13.06.2017
Tags: ips, role, accountant, chief, lawyer, HR
Check modules in roles
------------------------------------------
* Authorisation user - "grandauto1@mailinator.com" and pwd - "1111" with localization page "2"
* Go IPS Configuration "Гранд"
* Check module is Displayed in role
|    module                        |    role    |
|----------------------------------|------------|
|Законодательство Украины          |Руководителю|
|Законодательство Украины          |Юристу      |
|Законодательство Украины          |Бухгалтеру  |
|Законодательство Украины          |Кадровику   |
|Правовая картина дня              |Руководителю|
|Правовая картина дня              |Юристу      |
|Правовая картина дня              |Бухгалтеру  |
|Правовая картина дня              |Кадровику   |
|Новации                           |Руководителю|
|Новации                           |Юристу      |
|Новации                           |Бухгалтеру  |
|Новации                           |Кадровику   |
|Отрасли экономики                 |Руководителю|
|Алгоритмы действий                |Руководителю|
|Бухгалтер и закон                 |Бухгалтеру  |
|Типовые договоры и шаблоны        |Руководителю|
|Типовые договоры и шаблоны        |Юристу      |
|Типовые договоры и шаблоны        |Бухгалтеру  |
|Типовые договоры и шаблоны        |Кадровику   |
|Банкротство                       |Руководителю|
|Банкротство                       |Юристу      |
|Банкротство                       |Бухгалтеру  |
|Власть Украины                    |Руководителю|
|Власть Украины                    |Юристу      |
|Власть Украины                    |Бухгалтеру  |
|Власть Украины                    |Кадровику   |
|Ситуации для бухгалтера           |Бухгалтеру  |
|Ситуации для юриста               |Юристу      |
|Формы и бланки                    |Бухгалтеру  |
|Законопроекты                     |Юристу      |
|Судебная практика                 |Юристу      |
|Судебные прецеденты               |Юристу      |
|Комментированные кодексы          |Юристу      |
|Европейское законодательство      |Юристу      |
|Искусство обороны                 |Юристу      |
|Терминологический словарь         |Юристу      |
|Ситуации для бизнеса              |Руководителю|
|Консультации личного эксперта     |Бухгалтеру  |
|Календарь бухгалтера              |Бухгалтеру  |
|Календарь юриста                  |Юристу      |
|База налоговых знаний             |Бухгалтеру  |
|Ситуации для кадровика            |Кадровику   |
|Судебная практика для бухгалтера  |Бухгалтеру  |
|Калькулятор отпусков              |Бухгалтеру  |
|Калькулятор отпусков              |Кадровику   |
|Калькулятор индексации зарплаты   |Бухгалтеру  |
|Калькулятор индексации зарплаты   |Кадровику   |
|Калькулятор штрафов               |Юристу      |
|Инструкции и шаблоны для кадровика|Кадровику   |
|Справочники                       |Бухгалтеру  |
|Справочники                       |Кадровику   |
|Бухгалтерские проводки            |Бухгалтеру  |

*Check module is NOT Displayed in role
|    module                        |    role    |
|Отрасли экономики                 |Юристу      |
|Отрасли экономики                 |Бухгалтеру  |
|Отрасли экономики                 |Кадровику   |
|Алгоритмы действий                |Юристу      |
|Алгоритмы действий                |Бухгалтеру  |
|Алгоритмы действий                |Кадровику   |
|Бухгалтер и закон                 |Руководителю|
|Бухгалтер и закон                 |Юристу      |
|Бухгалтер и закон                 |Кадровику   |
|Банкротство                       |Кадровику   |
|Ситуации для бухгалтера           |Руководителю|
|Ситуации для бухгалтера           |Юристу      |
|Ситуации для бухгалтера           |Кадровику   |
|Ситуации для юриста               |Руководителю|
|Ситуации для юриста               |Бухгалтеру  |
|Ситуации для юриста               |Кадровику   |
|Формы и бланки                    |Руководителю|
|Формы и бланки                    |Юристу      |
|Формы и бланки                    |Кадровику   |
|Законопроекты                     |Руководителю|
|Законопроекты                     |Бухгалтеру  |
|Законопроекты                     |Кадровику   |
|Судебная практика                 |Руководителю|
|Судебная практика                 |Бухгалтеру  |
|Судебная практика                 |Кадровику   |
|Судебные прецеденты               |Руководителю|
|Судебные прецеденты               |Бухгалтеру  |
|Судебные прецеденты               |Кадровику   |
|Комментированные кодексы          |Руководителю|
|Комментированные кодексы          |Бухгалтеру  |
|Комментированные кодексы          |Кадровику   |
|Европейское законодательство      |Руководителю|
|Европейское законодательство      |Бухгалтеру  |
|Европейское законодательство      |Кадровику   |
|Искусство обороны                 |Руководителю|
|Искусство обороны                 |Бухгалтеру  |
|Искусство обороны                 |Кадровику   |
|Терминологический словарь         |Руководителю|
|Терминологический словарь         |Бухгалтеру  |
|Терминологический словарь         |Кадровику   |
|Ситуации для бизнеса              |Юристу      |
|Ситуации для бизнеса              |Бухгалтеру  |
|Ситуации для бизнеса              |Кадровику   |
|Консультации личного эксперта     |Руководителю|
|Консультации личного эксперта     |Юристу      |
|Консультации личного эксперта     |Кадровику   |
|Календарь бухгалтера              |Руководителю|
|Календарь бухгалтера              |Юристу      |
|Календарь бухгалтера              |Кадровику   |
|Календарь юриста                  |Руководителю|
|Календарь юриста                  |Бухгалтеру  |
|Календарь юриста                  |Кадровику   |
|База налоговых знаний             |Руководителю|
|База налоговых знаний             |Юристу      |
|База налоговых знаний             |Кадровику   |
|Ситуации для кадровика            |Руководителю|
|Ситуации для кадровика            |Юристу      |
|Ситуации для кадровика            |Бухгалтеру  |
|Судебная практика для бухгалтера  |Руководителю|
|Судебная практика для бухгалтера  |Юристу      |
|Судебная практика для бухгалтера  |Кадровику   |
|Калькулятор отпусков              |Руководителю|
|Калькулятор отпусков              |Юристу      |
|Калькулятор индексации зарплаты   |Руководителю|
|Калькулятор индексации зарплаты   |Юристу      |
|Калькулятор штрафов               |Руководителю|
|Калькулятор штрафов               |Бухгалтеру  |
|Калькулятор штрафов               |Кадровику   |
|Инструкции и шаблоны для кадровика|Руководителю|
|Инструкции и шаблоны для кадровика|Юристу      |
|Инструкции и шаблоны для кадровика|Бухгалтеру  |
|Справочники                       |Руководителю|
|Справочники                       |Юристу      |
|Бухгалтерские проводки            |Руководителю|
|Бухгалтерские проводки            |Юристу      |
|Бухгалтерские проводки            |Кадровику   |

_________________________________________________
