Modules and Situations
=====================
Created by FedorchukR on 22.05.2017

This is an executable specification file which follows markdown syntax.
Every heading in this file denotes a scenario. Every bulleted point denotes a step.
     
Open Modules and Situations
----------------

* Authorisation our user with conf file with localization page "2"
* Go IPS Configuration "Гранд"
Go product "CONTR AGENT"
* Open module, search in module with check after sort list on and open document
|       nameModule                 |                  strSearch                             |  vSortList  |
|----------------------------------|--------------------------------------------------------|-------------|
|      Законодательство Украины    |                Опубликование в периодике               |Релевантность|
|      Законодательство Украины    |                Официальное опубликование               |Релевантность|
|      Законодательство Украины    |                    Законы в тезисах                    |Релевантность|
|        Cудебные прецеденты       |                Хозяйственный суд                       |Релевантность|
|      Законодательство Украины    |                                                        |     Дата    |
|    Типовые договоры и шаблоны    |      График уборки гауптвахты дежурными                |Релевантность|
|       Отрасли экономики          |    операції з фінансовими активами, що здійснюються    |Релевантность|
|       Алгоритмы действий         |     погашення заборгованості на підставі мирової       |Релевантность|
|       Алгоритмы действий         |               Процедура регистрации ФЛП                |Релевантность|
|       БУХГАЛТЕР И ЗАКОН          |     Окремі виплати під час розрахунку відпускних       |Релевантность|
|        Банкротство               |       товариство з обмеженою відповідальністю          |Релевантность|
|        Формы и бланки            |     Податкова декларація з транспортного податку       |Релевантность|
|        Законопроекты             |               Про внесення змін                        |Релевантность|
|        Cудебные прецеденты       |                Судова палата у цивільних справах       |Релевантность|
|        Судебная практика         |      провадження в адміністративній справі             |Релевантность|
|        Судебная практика         |      О признании незаконным и отмене Указа Президента  |Релевантность|
|   Европейское законодательство   |           щодо зобов'язання стосовно публікації        |Релевантность|
|        Искусство обороны         |                  Штрафы Гоструда                       |Релевантность|
|   Консультации личного эксперта  |            Плату за аренду земельного пая              |Релевантность|
|       База налоговых знаний      |      Чи необхідно по придбаним та/або виготовленим     |Релевантность|
|       Судебная практика          |     звернулося до Окружного адміністративного          |Релевантность|
|       Инструкции и шаблоны       |               призначається на посаду                  |Релевантность|
|          Справочники             |              святкових та неробочих днів               |Релевантность|
|      Законодательство Украины    |должности заместителя Министра молодежи и спорта Украины|Релевантность|
* Open situation, search in module with check after sort list on and open document
|       nameModule    |         strSearch         | vSortListAfterClick | vSortListAfterSearch |
|---------------------|---------------------------|---------------------|----------------------|
|     для кадровика   |    Рабочее время          |         Дата        |     Релевантность    |
|     для юриста      |    Договоры               |         Дата        |     Релевантность    |
|     для бухгалтера  |    Иностранная валюта     |         Дата        |     Релевантность    |
|     для бизнеса     |    Управление персоналом  |         Дата        |     Релевантность    |
* Tear down step 1