Phrases and Suggest
=====================
Created by FedorchukR on 29.06.2017

This is an executable specification file which follows markdown syntax.
Every heading in this file denotes a scenario. Every bulleted point denotes a step.
     
Search any phrases and check suggest
----------------

* Authorisation our user with conf file with localization page "2"
* Go IPS Search
* Suggest after the context search
|                PHRASES               |                      EXPECTED                               |
|--------------------------------------|-------------------------------------------------------------|
|          авторський нагля            |                      авторський нагляд                      |
|             авторське                |                       авторське право                       |
|               вало                   |                       валові витрати                        |
|             бюджетне                 |                    бюджетне відшкодування                   |
|           про охорону                |       закон про охорону навколишнього природного середовища |
| О внесении изменений в Закон* Украин |             О внесении изменений в Закон* украина           |
| О внесении изменений в Закон (Украин |             О внесении изменений в Закон  украина           |
* Сontext search any phrases with switching tabs
|                       PHRASES                                    |             TABS                |
|----------------------------------------------------------------------------------------------------|
|     нормативно-прав!в* актов органов исполнительных власти       |     Все документы               |
|     російськомовним маркуванням вжити заходів щодо вилучення*    |     Законодательство            |
|    (сдаче)! на МГСП следующими железнодорожными администрациями  |     Судебная практика           |
|            з питань охорони пр*ці, участі в лекціях              |     Аналитика                   |
|   Сектору Державної служби боротьб? з економічною злочинністю    |     Справочники                 |
|             Учет рабочег? времени водителей                      |     Формы, бланки, шаблоны      |
|План погрузки выполнен большинством железнодорожных администраций*|     Издания                     |
|           котор*е стояли на остановке за городом                 |     Правовая картина дня        |